{"source_file": "Liu Family Trust Filings & Documents/1985-01-31 Mobile Home Park Related.pdf", "source_sha256": "e28810d04c65b05b55bc429e260f0f2ccebf3aa2bf58574a7c8ffcbef393fde8", "page_count": 5, "chars_extracted": 12665, "is_empty": false, "chunks": [{"text": "--- Page 1 ---\nMALTER'S\nE\nM\nMICHAEL, W . MAL TER is  an\nattorney i n Sunnyvale with a\npractice emphasizing Bank-\nruptcy, Wage Earner Plans,\nBusiness Reorganizations, Per-\nsonal Injury, and MobilehomeLaw.\nGuest Columnist\nDougles A . Bird\nDouglas Bird, is  a staff attorney with\nLegal A i d Society of San Jose i n the\nLandlord Tenant  Division. He  has been\na n attorney w i t h Legal  A i d f o r 10\nyears. M r . Bird participated in the\ndrafting o f t h e S a n Jose Rent  Control\nOrdinance a n d represented t h e mobile-\nhome tenants i n the case discussed\nbelow.\nO n M a y 1 7 , 1984, judgement wasentered on behalfo f t h e RaynorAssociation o f T enants against the\nlandlord i n the  case  o f R a y n o r Associa-\nt i o n o f T enants, et  al., v s . F e n g K . Liu\n& Associates, et  al., Santa Clara\nCounty Superior Court N o . 509448.\nThe court ordered the defendant\nlandlord t o p a y the  tenants civil  pen-\nalties f o r wilfully violating provision\no f the  Mobilchome Residency Law\n(MRL) (C.C. § 7 9 8 , ct  seq.). I n addi-\ntion thereto, t h e Court f o u n d t h e de-\nfendant landlord had committed a n un-\nSunnyvale Mobilehome Tenants\nW i n Court  Battle  W i t h Landlord,But The Wa r Goes  On To Preserve  Their Homes\nf a i r business practice b y violating theo f 1 9 8 2 . Stuart M . Wilson, a S a n Joseinformed a developer is  i n the process\nMRL a n d enjoined a n d restrained theattorney w h o specializes i n landlord/o f purchasing t h e property . The  tenantsdefendants from future violations. tenant law and criminal defense,\nrespresented t h e T enant's Association.\n\" W i t h i n the  periodAlso representing the tenants was  the . . changed park rules\nLegal A i d Society o f Santa Clara without affording tenantsof a year County•\ndefendants raised the rent\ns i x months written notice.\"F r a n k Hanley , a p a r k resident,\ni n excess of 150%' organized the tenants. As a solid now must wage a battle o f prevent aTenant's Association t h e y were able to\nThe case arose out o f the landlords' obtain relief f r o m the  landlords' illegalchange  o f l a n d use  that  w o u l d displacethe residents.\nfailure t o offer the residents one-year activities i n Court. Frank Hanley also\nlease agreements. W ithin the period oforganized a drive t o put  rent control on\na y e a r defendants raised the  rent i n ex-the ballot i n Sunnyvale. As  y o u may\ncess o f 1 5 0 % placing enormous ﬁnan-know the tenants lost their bid for rent\ncial pressure o n t h e residents o n ﬁxedcontrol i n the  November 1 9 8 3 election, Fashion Hints\nincomes. I n addition thereto, the  land-\nlord changed park rules without afford-:\" . . . residents were able to If y o u want  to feel  better , l o o k better,\nsays Fashion Consultant Aylene  K u h n -i n g tenants s i x months written notice. obtain broad injunctiveoffering these helpful hints:The  defendants closed down park fa- relief against the landlords'cilities without a n y notice t o residents. Y o u r s k i n often lightens as  y o u grow\nTenants were required t o purchase illegal activities.\" o l d e r a n d y o u r h a i r tends t o gray , s o the\nmost ﬂattering colors are lavender,Skirting for their coaches without six powder blue and pink.month's notice. The tenants began to however, they made  a good showingr I f y o u carry y o u r weight around yourorganize into a Tenant's Association toat  t h e polls. O f course, a combination w a i s t , l o o k f o r outﬁts t h a t don't put  em-determine what  their rights w e r e . Theo f outside landlord money a n d a n ag- phasis o n the  waist, suchas an\nTenant's  Association demanded thegressive c a m p a i g n b y the  real  proper-overblouse or a dress that can be worn\nlandlord offer all  residents one-yeart y interests o f the State defeated the loose or belted\nlease agreements. The  defendants inresidents' bid for rent relief.I f you've gained weight, wear a n open\nresponse engaged i n a pattern o f retalia-Nonetheless, tenant activists like  Frank collar. A high collar makes your face\ntion to break the Tenant's Association. Hanley will continue the battle f o r fair look rounder.\nrents i n future elections. ~ Shorter h a i r gives y o u r face  a n uplift,\n\"Tenants were  required to The  lawsuit  is  signiﬁcant i n that while long hair tends t o pull it  down.\nA f t e r 5 0 , short hair is  usually more\npurchase skirting for theirresidents were able t o obtain broad in- ﬂattering.junctive relief against t h e landlords' il-coaches without six Matching separates will  give y o u thelegal activities. The  landlord w a s also most  wardrobe versatility , since a jacket\nmonth's notice.\" ordered t o p a y the tenants reasonable can do double duty with a skirt or pants.\nattorneys' fees  a n d Court costs. * If you are  unsure about a n outﬁt. trust\nT o protect the  Tenant's Association The  battle goes o n however . The y o u r intuition. Over the  years. you've\nand t o compel compliance with state landlord now  is  selling the  propertyﬁgured out  what  looks g o o d o n you.\nl a w . suit  was  commended i n Octobersucking its  proﬁt o u t . The residents are\n\n--- Page 2 ---\nMANUFACTURED HOUSING\nEDUCATIONAL TRUST\nSanta Clara County\nRECEIVED JUN3 1983\nP e n i n a n t , JaneresPeninsul Tribune\nRent  control  friends  a n d foes\nturn out in force at Sunnyvale\nB y David HoyeTimes Tribune staff\nSUNNYV ALE - A formerly\nquiet campaign to get rent control\napproved here burst into public\nview  Friday afternoon when about\n150 people on both sides of the\n*issue  gathered at  C i t y Hall.The  impetus for the cheering,\nplacard-toting crowds was  the ﬁling\nof petitions bearing more than\n10,500 signatures of rent control\nsupporters w i t h C i t y C l e r k Carol\nRent control supporters have\nbeen collecting signatures at the li-\nbrary, post ofﬁce and Community\nCenter since F e b r u a r y. Led by\nlocal resident Frank Hanley, they\nhope t o qualify the issue for the\nNov . 8 ballot.\nAbout 1 0 0 people, Including a\ngroup of workers given the after-\nnoon o f f t o attend the rally, gath-\nered to oppose rent control outside\nthe Olive Avenue entrance to City\nHall. Several carried colorful signs\" R e n t control  means\nh i g h e r taxes\" a n d \"Rent  controlhas never worked.\"\nUnder a tree a short distance\naway , Hanley stood with about 50\nsupporters and members  of the\nSunnyvale Renters Association and\ncollected last-minute signatures.\nOccasionally the supporters waved\ntheir o w n signs like \" H u m a n needs\n• not Corp. greed\" and \"Renters'\nthat the council, which is  opposedbile home park and turned out Fri-\nto rent control, is using the pro-day as one o f Hanley's supporters.\nposed service t o \"derail support for \"They raised o u r rent $ 2 5 last\nyear and $15 the y e a r before.\n\"We're not going to accept a car-There's no stopping them. They're\nrot,\" he  s a i d . \"We want social jus-making a heck of a proﬁt, no\ndoubt,\" DePew said.\nDespite the strong feelings typi- Local real estate broker Bobbie\ncal o f rent-control campaigns, bothLemberg was spokeswoman for\ncrowds remained relatively calm.Sunnyvale Vo t e r s Against Rent\nShortly after 2 p.m., HanleyControl, which helped organized\nmarched into C i t y Hall  ﬂanked b y athe opposition.\nnumber o f supporters and turned She said with rent control, land-\nover the petitions to the city clerk. lords would refuse to p a y the high\nButler said the petitions would becost of maintenance  a n d rental\nforwarded Monday to the Santa properties would deteriorate. In ad-\nClara County Registrar o f Vo t e r s .dition, she said limiting proﬁts\nThere, the signatures of local would drive developers elsewhere\nvoters will be veriﬁed through aand cause the housing shortage to\nsampling process that normallyworsen.\ntakes about two weeks. \"If (Hanley) says housing is a\nI f the petitions are found to havepublic utility, where does i t stop?\nsignatures o f at least 1 5 percentW i t h food?\" she said.\nof the city's registered voters, the A group o f about eight carpen-\nC i t y Council will be forced to placeters from Property Services i n San\nthe issue on the November ballot. Jose were among the group op-\nIt approved, the rent control ini-posed to rent control.\ntiative would establish a ﬁve-mem- When asked about their interest\nb e r elected board to set rent limits i n t h e rally, Mike Hunnicutt sald\nand review proposed increases.t h e y were  g i v e n t h e a r t e r n o o n off\nHanley said a n 18-month \"roll-with the condition they attend the\nclause  would cut rents toevent.\nMay. 1982 levels. Landlords could He  said rent control would dis-\nthen request adjustments to thecourage  rental  maintenance  and\nrent based on their operating costshurt his company.\n\"There won't be as much work.\nH e said the initiative would pro-If landlords can't increase the rent,\nvide reasonable proﬁts f o r land-the money won't be there to pay for\nlords while protecting tenants fromus,\"  Hunnicutt said\nrent gouging a n d proﬁteering. After the crowds had dispersed,\nAll  the while, Hanley munched \"Rental housing should be regu-Hanley said he was surprised the\non a carrot, which he said symbo-lated much like any public utility,\"opposition had had such a large\nlized the recent decision by the City turnout.\nCouncil to c o n s i d e r a landlord-ten- Mobile  home  o w n e r Russell \"I realize we've got an uphill bat-\nant mediation service. He  charged DePew rents a space i n a local m o - tle, but it's winnable,\" he  said.\n7 7 7 North First  Street • Suite 6 0 0 • S a n J o s e , California 951 12 • 4 0 8 / 294-1474\n\n--- Page 3 ---\nPRIME  \nLAND  \nON  \nEL  \nCAMINO  \nREAL  \nF O R \nSALE\nProperty:\no \nZoning: \np l a n n e d \ndevelopment \nhighway \ncommercial \nand \nmulti-\nresidential  \n(C-2 \nP D , \nR-3)\n• \n2 8 9 \nfront \nfeet \no n \nbusy \nbusiness \nstreet \nEl  \nCamino \nReal\n• \nSemi-developed,\nideal  \nf o r \nfuture\ndevelopment\nh o t e l / m o t e l , \nofﬁce\nbuilding,shopping c e n t e r or mid-rise\ncondos \nwhile \ne n j o y i n g \ncurrent  \ngood \nincome\n• \nHas \na \ncar \ndealer, \na \nlocksmith \nstore \na n d \n& \nmobilehome \npark\n(42 \nu n i t s ) \no n \nthe  \npremise; \nhas \nan \nannual \ngross \nrental  \nincome\nof \nover \n$136,000 \nin \n1983.\nTerms \nof \nSale:\nSales \nPrice \n: \n$1,928,000 \n( \nabout \n$14.50 \nper \nsquare \nfoot)\nD o w n \nPayment: \n30%\nBalanceNew loan or owners carry at 1 3 % for 8 years\nCommission \n: \n3x \nf o r \ns e l l i n g \nofﬁce\nContact: \nFeng \nK . \nLiu \nor \nGrace \nLiu \nat  \n(408) \n739-5465 \na f t e r \n5 \nPM\no r \nwrite  \nto:\nF. \nK . \nLiu 1878\nLangport \nDrive\nSunnyvale, Ca. 94087\n\n--- Page 4 ---\nFORECLOSURE  COMPANY\nFebruary 25, 1986\nA m e r i c a n \nTitle  \nInsurance  \nCompany\n5595 \nW i n ﬁ e l d \nBlva.\nSuite  108\nSan \nJ o s e , \nCalifornia  \n95123\nRe:  1Your O r d e r No. 8502150\nOur \nF o r e c l s o u r e \nNo.84-436\nBorrower:  Howard Vierra\nDee\nof \nTrust:  \nI683/696\nA t t n : J e f f Van Valer\nPursuant \nto \nthe \nl e t t e r \nof \nCommonwealth \nLand \nTitle  \nCo.,\nrequesting \npayoff \nﬁgures  \non \nthe \nabove \nreferenced, \nas\nfollows:\n$1, 436,460.00 Principal\n286,334.36\nInterest  \n@ 1 2 % \ndue \nfrom \nJuly \n1, \n1984\nto February 2 8 , 1986 ($478.82 per\ndiem \nuntil  \nreceived)\n6 , 0 0 0 , 0 0 Late  charge\n5 , 8 9 4 . 0 0 A t t o r n e y s fees\n9,167.35 \nTrustee's \nfees \nand \nexpenses\n$1,743,855.71\n250,000.00 \nCredit  \npayment \nreceived \nthrough\nBankruptcy Court\n$ 1 , 4 9 3 , 8 5 5 . 7 1 \nTOTAL \nDUE\nUpon \nreceipt  \no f \nyour \ncheck \nmade \npayable  \nto \nThe \nForeclosure\nCompany, \nInc., \nwe  \nwill  \nissue  \nthe \nDeed \nof \nReconveyance.\nShould \nyou \nhave \nany \nquestions \nregarding \nthis  \nﬁ l e , \nplease\ncall  \nupon \nus.\nVery t r u l y yours\nBharol  tang\nF o r e c l o s u r e \nOfﬁcer\nSL:  bm\ncc:  • Commonwealth Land\nWm  \nHurley\nLiu\n2 2 0 5 S o u t h Bascom  Avenue\n• \nCampbell, \nCalifornia \n95008 : in\n408/377-8911\n\n--- Page 5 ---\nTHE  \nFORECLOSURE  \nC O . , \nINC. TRUST ACCOUNT\n2205 S . BASCOM  A V E . 377-8911\nC A M P B E L L , CA95008\n84-436\nPAY TO  THE\nORDER OF.\nFENG \nKUANG  \nLIU \na n d \nMEICHU \nGRACE \nLIU\nM a r c h 3\n1986-\nO N E \nM I L L I O N \nF O U R \nHUNDRED  \nEIGHTY \nSIX \nTHOUSAND  \nTWO  \nHUNDRED  \nNINE \n& \n6 4 / 1 0 0 \n- \n-\nPaciﬁc \nV alley \nBank 1 0 0 2 0 N o r t h De  Anza  Blvd.\nCupertino, California 95014\n1 0 2 2 5 5 3   0 . h 2 2 2 3 5 9 1 9 :   0 2   0 1 9 7 9   2 1\nT H E \nFORECLOSURE \nCO., \nINC.\nDETACH \nAND \nRETAIN \nTHIS \nSTATEMENT\nTHNOT  \nCORRECT  \nPLEASE  \nNOTIFY  \nUS  \nPROMPTLY\nDESCRIBED \nBELOW.\nNO  RECEIPT DESIRED.\nDELUXE - FORM DVC-3 V-2\nDESCRIPTION\nPayoff b y Howard Vierra\n$1,436,460.00 Principal\n286,334.36 I n t . to 2/28/86\n1,915.28 Int. to 3/4/86\n6,000.00 \nLate \ncharge\n5,500.00 \nForeclosure \nDeposit\n250,000.00 \nCredit \nto \nseller\nDATE\n3/3/86\n$1,486,209.64 \nTOTAL  \nDUE\n11553\n90-3591/1211\n$1,486,209.64- \n- \nDOLLARS\nAMOUNT\n$1,486,209.64", "page_start": 1, "page_end": 5, "chunk_index": 0, "total_chunks": 1}]}